{
  "backend/main.mo": "Motoko canister storing customization requests with submit, fetch, and timestamp-sorted retrieval functions.",
  "feature_evidence.json": "Feature-to-file mapping report describing implemented frontend features and their associated components and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files detailing their purpose and functionality.",
  "frontend/index.css": "Tailwind setup defining global OKLCH color variables for light/dark modes and applying base styles.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React application root.",
  "frontend/src/App.tsx": "Configures TanStack Router with routes for Home, Gallery, Customize, and Contact inside a shared Layout.",
  "frontend/src/components/DesignSelect.tsx": "Dropdown component listing invitation designs for selection during customization.",
  "frontend/src/components/InvitationPreviewDialog.tsx": "Dialog showing a full-size invitation preview with buttons to customize or close.",
  "frontend/src/components/Layout.tsx": "Global layout with header navigation, mobile menu, main content slot, and branded footer.",
  "frontend/src/components/SubmissionStatus.tsx": "Alert component displaying success or error messages after form submissions.",
  "frontend/src/data/invitations.ts": "Static array describing eight invitation designs with IDs, names, styles, and images.",
  "frontend/src/hooks/useActor.ts": "React hook creating and refreshing the backend actor based on Internet Identity authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, exposing identity state, login, logout, and status helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to submit customization requests and fetch all stored requests from the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining base styles, theme variables, and typography for light and dark modes.",
  "frontend/src/main.tsx": "Entrypoint that renders the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact information page with designer details, phone number, and availability.",
  "frontend/src/pages/CustomizePage.tsx": "Provides a form for users to submit wedding invitation customization details via a backend mutation.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a grid of invitation designs and opens a preview dialog when a design is selected.",
  "frontend/src/pages/HomePage.tsx": "Home page showing hero content and navigation to gallery and customization flows.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata including versioning, feature list, image requirements, and a summary of the wedding invitation website scope."
}