{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Build an attractive wedding invitation card website ('weeding brochure') showcasing card images, allowing customers to view and customize designs, and providing contact details to request hardcopy printing via the Gharpic designer owner (9824469590).",
  "architectural_notes": [],
  "known_issues": [],
  "isFixRequest": false,
  "imageRequirements": "## Required Images\n- Wedding invitation website hero banner with elegant floral border on a warm neutral background (weeding-brochure-hero.dim_1600x700.png)\n- Set of 8 distinct wedding invitation card design images with varied styles (minimal, floral, traditional, modern) (invitation-01.dim_1200x800.png)\n- Set of 8 distinct wedding invitation card design images with varied styles (minimal, floral, traditional, modern) (invitation-02.dim_1200x800.png)\n- Set of 8 distinct wedding invitation card design images with varied styles (minimal, floral, traditional, modern) (invitation-03.dim_1200x800.png)\n- Set of 8 distinct wedding invitation card design images with varied styles (minimal, floral, traditional, modern) (invitation-04.dim_1200x800.png)\n- Set of 8 distinct wedding invitation card design images with varied styles (minimal, floral, traditional, modern) (invitation-05.dim_1200x800.png)\n- Set of 8 distinct wedding invitation card design images with varied styles (minimal, floral, traditional, modern) (invitation-06.dim_1200x800.png)\n- Set of 8 distinct wedding invitation card design images with varied styles (minimal, floral, traditional, modern) (invitation-07.dim_1200x800.png)\n- Set of 8 distinct wedding invitation card design images with varied styles (minimal, floral, traditional, modern) (invitation-08.dim_1200x800.png)\n- Simple elegant wordmark logo in a warm neutral palette (weeding-brochure-logo.dim_512x512.png)",
  "existing_features": [
    {
      "id": "feature-set-up-the-website-branding-and-global-layout-for-the-site-name-weeding-brochure-including-a-responsive-header-nav-footer-and-consistent-typography-and-spacing-across-all-pages",
      "title": "Set up the website branding and global layout for the site name “Weeding Brochure”, including a responsive header/nav, footer, and consistent typography and spacing across all pages.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-an-invitation-card-gallery-catalog-page-that-displays-wedding-invitation-card-images-with-basic-metadata-e-g-design-name-and-supports-viewing-a-larger-preview-of-a-selected-design",
      "title": "Implement an invitation card gallery/catalog page that displays wedding invitation card images with basic metadata (e.g., design name) and supports viewing a larger preview of a selected design.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-customize-flow-where-a-customer-can-select-a-design-and-submit-their-customization-requirements-e-g-names-date-venue-additional-notes-using-an-english-language-form",
      "title": "Add a “Customize” flow where a customer can select a design and submit their customization requirements (e.g., names, date, venue, additional notes) using an English-language form.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-connect-the-frontend-customization-form-submission-to-the-backend-persistence-api-and-show-a-clear-submission-success-state-and-error-state",
      "title": "Connect the frontend customization form submission to the backend persistence API and show a clear submission success state and error state.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "feature-create-a-contact-section-page-for-hardcopy-requests-that-prominently-displays-the-gharpic-designer-owner-contact-phone-number-9824469590-and-includes-a-click-to-call-link-on-mobile-devices",
      "title": "Create a Contact section/page for hardcopy requests that prominently displays the Gharpic designer owner contact phone number “9824469590” and includes a click-to-call link on mobile devices.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "feature-apply-a-coherent-attractive-visual-theme-for-a-wedding-invitation-brand-not-using-blue-purple-as-the-primary-palette-including-a-hero-section-on-the-home-page-and-consistent-styling-of-cards-buttons-and-form-elements",
      "title": "Apply a coherent, attractive visual theme for a wedding invitation brand (not using blue & purple as the primary palette), including a hero section on the home page and consistent styling of cards, buttons, and form elements.",
      "reqIds": [
        "REQ-7"
      ],
      "version": 1
    },
    {
      "id": "feature-add-the-generated-image-assets-to-the-frontend-as-static-files-and-render-them-in-the-ui-home-hero-and-gallery-without-routing-image-delivery-through-the-backend",
      "title": "Add the generated image assets to the frontend as static files and render them in the UI (home hero and gallery) without routing image delivery through the backend.",
      "reqIds": [
        "REQ-8"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Create an attractive website named 'weeding brochure' for wedding invitation cards",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add an image gallery/catalog so customers can view wedding invitation card designs",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Allow customers to customize their own wedding invitation cards based on their requirements",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Provide a contact section for hardcopy requests, including the Gharpic designer owner phone number (9824469590)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-8",
      "summary": "Persist submitted customization requests in the Motoko backend so that requests are not lost on page refresh, including timestamp and the selected design identifier (if any).",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "weeding brochure",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}